{"pages":[],"posts":[{"title":"CSE168 Project 1","text":"Long time no see! For the past quarters, I took some fantastic courses in computer graphics, and discovered my interests in this field. Starting from this post, I will document my homework projects from CSE168 rendering course. Although I did not add any extra features for project 1, I plan to learn more by implementing extra features in later projects. Future posts will include more so that TAs could evaluate my work easily. This cover is rendered by a simple ray tracer. We’ll see how it evolves in the following weeks.","link":"/en/CSE168-Project1/"},{"title":"Hello World Again","text":"Hello World Again :-) This is ZYT’s blog. I say “Hello World Again” because I setup this Hexo blog in spring break earlier, but stopped due to school work and my laziness. Last week, after the summer session, I finally finished a tiny project started in the spring break. What coming next is this blog. This time, I switch to theme Minos. I read Hexo documentations in depth, add multi-language support, and setup a GitHub-based image hosting service. I hope all these works can encourage me to keep writing blogs. I will start with sharing some photographs taken last summer vacation. Then, I will share my notes on Scoop, Vim, gcov, and other technical topics. A journey of a thousand miles begins with single step.","link":"/en/Hello-World-Again/"},{"title":"VIS60 Homework 1","text":"La Jolla Cove, 07/13/2019 Update my blog with photography homework from VIS60 last summer. Done some modification and host these images in a GitHub repo. If above four images appear correctly, then the hosting system is working as I expected. Click them to see larger images! Short artist statement: This homework asked us to explore a small area. I chose the streets around La Jolla Cove and took pictures of street scenes. Images were about buildings, plants and vehicles. The theme is discovering unnoticed landscapes aside usual street. I hope to present these common landscapes in an interesting way. What I seek is a simple composition with geometric harmony. That’s it! Looking forward to post the second homework.","link":"/en/VIS60-Project1/"},{"title":"VIS60 Homework 2","text":"Scripps Memorial Pier, 07/21/2019 This is the second homework of VIS60 last summer. This homework asked us to choose a single object and demonstrate that object in different ways. I chose the Scripps Pier located at La Jolla. Scripps Institution of Oceanography takes samples of the ocean from this pier for scientific research. Artist statement: I took five pictures of the pier at different times from different angles. I want to demonstrate the look of the pier under changing point of views and light resources. The adding of background elements, like the surfing people and seagulls, further illustrate the flow of time around the pier. The most fun part of this homework is walking around and finding new positions to take pictures. I also enjoy the light during sunset, which add beautiful tones to the pier. In short, this homework is very enjoyable and I learnt a lot from it. Sticking to a single object is a great way to train myself. Also, the scenery of Scripps Beach is very beautiful. It is a perfect place for everyone to relax!","link":"/en/VIS60-Project2/"}],"tags":[{"name":"Ray Tracing","slug":"Ray-Tracing","link":"/en/tags/Ray-Tracing/"},{"name":"Rendering","slug":"Rendering","link":"/en/tags/Rendering/"},{"name":"Emotions","slug":"Emotions","link":"/en/tags/Emotions/"},{"name":"Streetscape","slug":"Streetscape","link":"/en/tags/Streetscape/"},{"name":"Landscape","slug":"Landscape","link":"/en/tags/Landscape/"},{"name":"Seaside","slug":"Seaside","link":"/en/tags/Seaside/"}],"categories":[{"name":"Computer Science","slug":"Computer-Science","link":"/en/categories/Computer-Science/"},{"name":"Photography","slug":"Photography","link":"/en/categories/Photography/"},{"name":"Ideas","slug":"Ideas","link":"/en/categories/Ideas/"},{"name":"Computer Graphics","slug":"Computer-Science/Computer-Graphics","link":"/en/categories/Computer-Science/Computer-Graphics/"}]}