{"pages":[],"posts":[{"title":"CSE168 Project 2","text":"Direct Lighting with Monte Carlo Integration $$L_d(x, \\omega_o) \\approx L_i \\frac{A}{N} \\cdot\\sum_{k = 1}^{N}f\\left(x, \\omega_i(k), \\omega_o\\right)G(x, x_k’)V(x, x_k’)$$ IntroductionIn this project, I implemented direct light sampling of area light sources with Monte Carlo integration. The equation above represents the Monte Carlo integration of one area light source $L_i$ with $N$ samples. The final color of one pixel is essentially the sum of emission and direct lightings from all area light sources. Below are some output results. Click them to view larger images: Sphere Cornell Box Dragon Variance and NoiseNotice that noises can be found in the image, especially in the shadows. This is caused by the variance of Monte Carlo integration with finite number of samples. As the number of samples increases, the variance could decrease, but just at a linear rate. So, apart from randomly sampling the area light, a stratified sampling method was implemented to further reduce the variance. Stratified sampling method divides the area light into little grids, and samples from each grid. This process essentially makes samples more uniformly distributed than purely random distribution, and thus reduce the noise. 9 Random Sampling 3x3 Stratified Random Sampling More Variance Reduction MethodsAfter writing the stratified sampling integrator, I also implemented two extra variance reduction methods. Biased Center SamplingThe first one is to sample area light source at the center, and only sample randomly for visibility. This method is biased, but could completely remove noise in area without shadows. Codes are written in OptiXRenderer/DIrectBiased.cu. The image below sampled the area light source only at the center. So, although there is no noise, the image is totally wrong and has visible bias. The bias can be reduced in combination with stratified sampling such that we are not just sampling the single center of the area light, but several centers of the little grids in the area light. The image below sampled centers from 3x3 stratified grids of the area light source. It appears very similar to the physically correct result, and there is no noise at all. 3x3 Stratified Biased Sampling 3x3 Stratified Random Sampling Bias: $-0.2$, Variance: 0.3 Bias: 0.0, Variance: 3.8 As the number of grids increases, the bias can be further reduced. Below are more comparisons between this biased method sampling at center, and random sampling method. 5x5 Stratified Biased Sampling 5x5 Stratified Random Sampling Bias: -0.1, Variance: 1.4 Bias: 0.0, Variance: 2.8 Bias: 0.0, Variance: 0.5 Bias: 0.0, Variance: 1.0 Bias: 0.0, Variance: 0.5 Bias: 0.0, Variance: 0.8 In the sphere scene and Cornell box scene, there are clearly less noise in areas without shadows. For example, the upper hemisphere is very smooth because there is no obstacle blocking it. However, this effect is not obvious in the dragon scene. In addition, because of this center sampling pattern is fixed across all pixels, some binding effects can be spotted in the left lower corner of the dragon scene. Overall, this method can significantly reduce noise in areas without shadows, but has no improvement on shadows, and may even cause banding issues in the shadows. Low Discrepancy Sequence SamplingWhile we enforce uniform distribution in stratified random sampling by cutting area light into grids, another approach is to directly generate numbers that area uniformly distributed. Formally, such numbers form a low discrepancy sequence, and Monte Carlo integration using low discrepancy sequence is called quasi Monte Carlo method. Below I will just refer this method as quasi random method for simplicity. I searched for some low discrepancy sequences, and initially want to implement a Sobol sequence generator to use in the integrator. However, I failed to comprehend all the math behind it, and in the end chose a simpler one called Van der Corput sequence. Since the integrator need to sample at a 2D area light source, I used two Van der Corput sequences, and this multidimensional generalization is called Halton sequence. Codes are written in OptiXRenderer/lowdis.h and OptiXRenderer/DirectQuasi.cu. 9 Quasi Random Sampling 9 Random Sampling 3x3 Stratified Random Sampling Bias: 0.0, Variance: 3.7 Bias: 0.0, Variance: 28.9 Bias: 0.0, Variance: 3.8 Images above show how the quasi random method reduced the variance without using stratification. It does not introduce any bias, and the final result is comparable with stratified random sampling with same number of samples. This is expected as both methods enforce better uniform distribution. Below are more comparisons between quasi method and stratified method. 25 Quasi Random Sampling 5x5 Stratified Random Sampling Bias: 0.0, Variance: 3.5 Bias: 0.0, Variance: 2.8 Bias: 0.0, Variance: 1.1 Bias: 0.0, Variance: 1.0 Bias: 0.0, Variance: 0.9 Bias: 0.0, Variance: 0.8 Overall, this quasi random method produces similar results as stratified random method. There is no bias or binding effect, which makes it an equivalently good alternative to the stratified random method. Because of my naïve implementation of sequence generator, the quasi random method does not have obvious performance difference from stratified random method. But since no stratification is required in quasi random method, it may gain better performance from getting rid of iteration. The Sobol sequence included in the reference could be a good choice since it replaces a lot of arithmetics with efficient bit operations. Full Reports of Submissions to UCSD OnlineHere are the link to reports generated on UCSD Online: Direct lighting with random and stratified random sampling: https://raviucsdgroup.s3.amazonaws.com/homework2/7ace409cf67531f2bb8a6fcfb7d7dfad/20210423042234/index.html Direct lighting with biased center sampling: https://raviucsdgroup.s3.amazonaws.com/homework2/7ace409cf67531f2bb8a6fcfb7d7dfad/20210423041831/index.html Direct lighting with low discrepancy sequence sampling: https://raviucsdgroup.s3.amazonaws.com/homework2/7ace409cf67531f2bb8a6fcfb7d7dfad/20210423042033/index.html Reference An introduction to quasi-random numbers 低差异序列（一）- 常见序列的定义及性质 低差异序列（二）- 高效实现以及应用 Notes on generating Sobol’ Sequences Sobol sequence generator","link":"/en/CSE168-Project2/"},{"title":"Hello World Again","text":"Hello World Again :-) This is ZYT’s blog. I say “Hello World Again” because I setup this Hexo blog in spring break earlier, but stopped due to school work and my laziness. Last week, after the summer session, I finally finished a tiny project started in the spring break. What coming next is this blog. This time, I switch to theme Minos. I read Hexo documentations in depth, add multi-language support, and setup a GitHub-based image hosting service. I hope all these works can encourage me to keep writing blogs. I will start with sharing some photographs taken last summer vacation. Then, I will share my notes on Scoop, Vim, gcov, and other technical topics. A journey of a thousand miles begins with single step.","link":"/en/Hello-World-Again/"},{"title":"VIS60 Homework 1","text":"La Jolla Cove, 07/13/2019 Update my blog with photography homework from VIS60 last summer. Done some modification and host these images in a GitHub repo. If above four images appear correctly, then the hosting system is working as I expected. Click them to see larger images! Short artist statement: This homework asked us to explore a small area. I chose the streets around La Jolla Cove and took pictures of street scenes. Images were about buildings, plants and vehicles. The theme is discovering unnoticed landscapes aside usual street. I hope to present these common landscapes in an interesting way. What I seek is a simple composition with geometric harmony. That’s it! Looking forward to post the second homework.","link":"/en/VIS60-Project1/"},{"title":"VIS60 Homework 2","text":"Scripps Memorial Pier, 07/21/2019 This is the second homework of VIS60 last summer. This homework asked us to choose a single object and demonstrate that object in different ways. I chose the Scripps Pier located at La Jolla. Scripps Institution of Oceanography takes samples of the ocean from this pier for scientific research. Artist statement: I took five pictures of the pier at different times from different angles. I want to demonstrate the look of the pier under changing point of views and light resources. The adding of background elements, like the surfing people and seagulls, further illustrate the flow of time around the pier. The most fun part of this homework is walking around and finding new positions to take pictures. I also enjoy the light during sunset, which add beautiful tones to the pier. In short, this homework is very enjoyable and I learnt a lot from it. Sticking to a single object is a great way to train myself. Also, the scenery of Scripps Beach is very beautiful. It is a perfect place for everyone to relax!","link":"/en/VIS60-Project2/"},{"title":"CSE168 Project 1","text":"Ray Tracer with Phong Shading $$I = A + E + \\sum_{i} V_i\\frac{L_i}{c_0 + c_1r + c_2 r^2}\\left(K_d \\cdot max(n \\cdot l, 0) + K_s\\cdot max(n \\cdot h, 0)^s\\right)$$ Long time no see! For the past quarters, I took some fantastic courses in computer graphics, and discovered my interests in this field. Starting from this post, I will document my homework projects from CSE168 rendering course. Although I did not add any extra features for project 1, I plan to learn more by implementing extra features in later projects. Future posts will include documentations of extra features so that TAs could evaluate my work easily. The following image is rendered by a simple ray tracer. We’ll see how it evolves in the following weeks.","link":"/en/CSE168-Project1/"}],"tags":[{"name":"Ray Tracing","slug":"Ray-Tracing","link":"/en/tags/Ray-Tracing/"},{"name":"Rendering","slug":"Rendering","link":"/en/tags/Rendering/"},{"name":"Monte Carlo Integration","slug":"Monte-Carlo-Integration","link":"/en/tags/Monte-Carlo-Integration/"},{"name":"Emotions","slug":"Emotions","link":"/en/tags/Emotions/"},{"name":"Streetscape","slug":"Streetscape","link":"/en/tags/Streetscape/"},{"name":"Landscape","slug":"Landscape","link":"/en/tags/Landscape/"},{"name":"Seaside","slug":"Seaside","link":"/en/tags/Seaside/"}],"categories":[{"name":"Computer Science","slug":"Computer-Science","link":"/en/categories/Computer-Science/"},{"name":"Ideas","slug":"Ideas","link":"/en/categories/Ideas/"},{"name":"Photography","slug":"Photography","link":"/en/categories/Photography/"},{"name":"Computer Graphics","slug":"Computer-Science/Computer-Graphics","link":"/en/categories/Computer-Science/Computer-Graphics/"}]}